In [1]:
friends = ['adeel','tauseef','irfan']
friends

['adeel', 'tauseef', 'irfan']

In [2]:
type(friends)

list

In [5]:
friends[2]

'irfan'

In [7]:
eng2sp = dict()

In [8]:
type(eng2sp)

dict

In [9]:
nationalGame = {'Pakistan':'Hockey', 
               'India':'Kabaddi'}

In [10]:
nationalGame

{'Pakistan': 'Hockey', 'India': 'Kabaddi'}

In [11]:
len(nationalGame)

2

In [12]:
len(eng2sp)

0

In [13]:
'Pakistan' in nationalGame

True

In [14]:
'Hockey' in nationalGame

False

In [15]:
vals = list(nationalGame.values())

In [16]:
'Hockey' in vals

True

In [ ]:
#{"good":1, "great":5, "bad":2, "nothappy": 3, "ok": 2}
#create a dictionary
#create a list of keys in that dic
#sort that list 
# print through loop 
#output should be similar to this {good:1, bad:2, ok : 2, }

In [18]:
myDict = {'adeel':1, "tauseef":4, "bilal":3}
myKeys= list(myDict.keys())
myKeys.sort()
sorted_dict= {i: myDict[i] for i in myKeys}
print(sorted_dict)

{'adeel': 1, 'bilal': 3, 'tauseef': 4}

In [19]:
myDict = {'adeel':1, "tauseef":4, "bilal":3}

for key in myDict:
    print(key, myDict[key])

adeel 1
tauseef 4
bilal 3

In [20]:
t = 'a', 'b', 'c', 'd', 'e'

In [21]:
type(t)

tuple

In [24]:
t = ('a', 'b', 'c', 'd', 'e')

In [25]:
type(t)

tuple

In [28]:
tuple1 = (10,20,30,40)
#how we can make 4 var out of this tuple?
a, b, c, d = tuple1
c

30

In [29]:
#swap 2 tuples?
tuple2= (20,30,50,60)

tuple1, tuple2 = tuple2, tuple1

In [30]:
tuple2

(10, 20, 30, 40)

In [31]:
tuple1

(20, 30, 50, 60)

In [32]:
myDict = {'adeel':1, "tauseef":4, "bilal":3}

items = list(myDict.items())
items

[('adeel', 1), ('tauseef', 4), ('bilal', 3)]

In [34]:
type(items[1])

tuple

In [36]:
type(items)

list

In [38]:
items.sort()
items

[('adeel', 1), ('bilal', 3), ('tauseef', 4)]

In [43]:
fruits= {"mango", "orange", "apple", "orange"}
fruits

{'apple', 'mango', 'orange'}

In [44]:
type(fruits)

set

In [48]:
fruits.add("cherry")

In [50]:
fruits.remove("orange")

In [51]:
fruits

{'apple', 'cherry', 'mango'}

In [53]:
print(type(fruits))

<class 'set'>

In [59]:
#parent class
class Employee:
    #class attribute
    emplyeerName = "Corvit"
    def __init__(self, name, age):
        #instance attribute
        self.name = name
        self.age = age
        #instance methods
    def description(self):
        print("Name of Employee is: " + self.name )
#instantiation
emp1 = Employee("Haider", 22)

In [62]:
#child class
class HREmployee(Employee):
    pass

In [64]:
hremp = HREmployee("Ali", 23)

In [65]:
hremp.description()

Name of Employee is: Ali

In [ ]:
#Create a Teacher class that inherits from the Employee class. 
#Give the sound argument of Teacher.salary() a default value of "basesalary". 
#Use the above code for your parent Employee class:

In [66]:
import pandas as pd

In [73]:
data = {"apples": [3,2,0,1], "oranges":[0,3,7,2]}

In [76]:
df = pd.DataFrame(data, index= ['adeel', 'tauseef', 'haider', 'sajjad'])

In [77]:
df

         apples  oranges
adeel         3        0
tauseef       2        3
haider        0        7
sajjad        1        2

In [78]:
iris_data = pd.read_csv('iris.csv')

In [79]:
iris_data

,Id,SepalLength[cm],SepalWidth[cm],PetalLength[cm],PetalWidth[cm],Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [83]:
iris_data.head()

,Id,SepalLength[cm],SepalWidth[cm],PetalLength[cm],PetalWidth[cm],Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa

In [81]:
iris_data.tail()

,Id,SepalLength[cm],SepalWidth[cm],PetalLength[cm],PetalWidth[cm],Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [84]:
import pandas as pd

url="https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
c=pd.read_csv(url)

In [85]:
c

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

In [86]:
iris_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Id               150 non-null    int64
 1   SepalLength[cm]  150 non-null    float64
 2   SepalWidth[cm]   150 non-null    float64
 3   PetalLength[cm]  150 non-null    float64
 4   PetalWidth[cm]   150 non-null    float64
 5   Species          150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [87]:
iris_data.shape

(150, 6)

In [92]:
iris_data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Length: 150, dtype: bool

In [93]:
iris_data.describe()

,Id,SepalLength[cm],SepalWidth[cm],PetalLength[cm],PetalWidth[cm]
count,150.000000,150.000000,150.000000,150.000000,150.000000
mean,75.500000,5.843333,3.054000,3.758667,1.198667
std,43.445368,0.828066,0.433594,1.764420,0.763161
min,1.000000,4.300000,2.000000,1.000000,0.100000
25%,38.250000,5.100000,2.800000,1.600000,0.300000
50%,75.500000,5.800000,3.000000,4.350000,1.300000
75%,112.750000,6.400000,3.300000,5.100000,1.800000
max,150.000000,7.900000,4.400000,6.900000,2.500000

In [94]:
iris_data[2:4]

,Id,SepalLength[cm],SepalWidth[cm],PetalLength[cm],PetalWidth[cm],Species
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa